public_html/music-of-radwimps.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-04-01 金 08:52 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>The Music of RADWIMPS</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Daniel Persigehl">
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href=""> HOME </a>
</div><div id="preamble" class="status">
<header><h1><a href="home.html">Quo usque tandem abutere, Daniel, patientia nostra?...</a></h1></header>
</div>
<div id="content">
<header>
<h1 class="title">The Music of RADWIMPS</h1>
</header><div id="outline-container-orgd8059b4" class="outline-2">
<h2 id="orgd8059b4">The Raddest of Wimps</h2>
<div class="outline-text-2" id="text-orgd8059b4">
<p>
English band names are far from unusual in Japan.  But "Rad" "wimp"
</p>

<p>
Ever since I was in middle school, I had been listening to bootlegged Japanese music.  My absolute favorite band was RADWIMPS, which I can even remember how I first found out about them (a fan-made anime music video for the anime Durarara).  I couldn't understand their lyrics at all, I just knew that I loved them.
</p>

<p>
And for a moody teenager, it was the perfect fit.
</p>
</div>
</div>
<div id="outline-container-org53cb824" class="outline-2">
<h2 id="org53cb824">Pera-Pera Eigo</h2>
<div class="outline-text-2" id="text-org53cb824">
<p>
One of the most notable things about RADWIMPS is their tendency to release English-language versions of their songs, even entire albums, such as the soundtracks for the anime films <i>your name.</i> and <i>Weathering with You</i>.
</p>

<p>
As with any non-native speakers of a language, there are the occasional stumbles, such as with stress accent or unusual turns of phrase.  Nonetheless, it is extremely impressive and the quality is superb.  Lord knows my Japanese is far from perfect.
</p>


<p>
Take, for example, 「<ruby> 愛<rp>(</rp><rt>ai</rt><rp>)</rp></ruby><ruby> に<rp>(</rp><rt>ni</rt><rp>)</rp></ruby><ruby> できる<rp>(</rp><rt>dekiru</rt><rp>)</rp></ruby><ruby> こと<rp>(</rp><rt>koto</rt><rp>)</rp></ruby><ruby> は<rp>(</rp><rt>wa</rt><rp>)</rp></ruby><ruby> まだ<rp>(</rp><rt>mada</rt><rp>)</rp></ruby><ruby> ある<rp>(</rp><rt>aru</rt><rp>)</rp></ruby><ruby> かい<rp>(</rp><rt>kai</rt><rp>)</rp></ruby>」, the lead single for <i>Weathering with You</i>.
</p>

<div class="org-center">
<p>
<iframe width="440" height="335" src="https://www.youtube.com/embed/EQ94zflNqn4" frameborder="0" allowfullscreen></iframe>
</p>

<p>
「<ruby> 愛<rp>(</rp><rt>ai</rt><rp>)</rp></ruby><ruby> に<rp>(</rp><rt>ni</rt><rp>)</rp></ruby><ruby> できる<rp>(</rp><rt>dekiru</rt><rp>)</rp></ruby><ruby> こと<rp>(</rp><rt>koto</rt><rp>)</rp></ruby><ruby> は<rp>(</rp><rt>wa</rt><rp>)</rp></ruby><ruby> まだ<rp>(</rp><rt>mada</rt><rp>)</rp></ruby><ruby> ある<rp>(</rp><rt>aru</rt><rp>)</rp></ruby><ruby> かい<rp>(</rp><rt>kai</rt><rp>)</rp></ruby>」 (Japanese ver.)
</p>
</div>

<p>
Now compare it with the English version.  Note the use of rhyme (and slant rhyme), which is inherently English and not Japanese (which favors parallelism).
</p>

<div class="org-center">
<p>
<iframe width="440" height="335" src="https://www.youtube.com/embed/P6uzlnLBFqU" frameborder="0" allowfullscreen></iframe>
</p>

<p>
"Is There Still Anything That Love Can Do?" (English ver.)
</p>
</div>

<p>
As any linguist knows, English versions are never exact translations.  Certain stylistic decisions must be made, such as how directly to translate metaphors and how much to adapt to idioms in the target language.  A 100% literal translation would, outside of a scholarly context, be quite painful to read.  However, these decisions can sometimes affect the entire tenor of a song.  Take, for example, the chorus that repeats throughout the song:
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Japanese version</th>
<th scope="col" class="org-left">English version</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><ruby> 愛<rp>(</rp><rt>ai</rt><rp>)</rp></ruby><ruby> に<rp>(</rp><rt>ni</rt><rp>)</rp></ruby><ruby> できる<rp>(</rp><rt>dekiru</rt><rp>)</rp></ruby><ruby> こと<rp>(</rp><rt>koto</rt><rp>)</rp></ruby><ruby> は<rp>(</rp><rt>wa</rt><rp>)</rp></ruby><ruby> まだ<rp>(</rp><rt>mada</rt><rp>)</rp></ruby><ruby> ある<rp>(</rp><rt>aru</rt><rp>)</rp></ruby><ruby> かい<rp>(</rp><rt>kai</rt><rp>)</rp></ruby></td>
<td class="org-left">I need to know if there's still anything that love can do?</td>
</tr>

<tr>
<td class="org-left"><ruby> 僕<rp>(</rp><rt>boku</rt><rp>)</rp></ruby><ruby> に<rp>(</rp><rt>ni</rt><rp>)</rp></ruby><ruby> できる<rp>(</rp><rt>dekiru</rt><rp>)</rp></ruby><ruby> こと<rp>(</rp><rt>koto</rt><rp>)</rp></ruby><ruby> まだ<rp>(</rp><rt>mada</rt><rp>)</rp></ruby><ruby> ある<rp>(</rp><rt>aru</rt><rp>)</rp></ruby><ruby> かい<rp>(</rp><rt>kai</rt><rp>)</rp></ruby></td>
<td class="org-left">I need to know if there's still anything that I can do</td>
</tr>
</tbody>
</table>

<p>
In the last chorus of the original song, the interrogative particle <ruby> かい<rp>(</rp><rt>kai</rt><rp>)</rp></ruby> is changed to the emphatic particle <ruby> よ<rp>(</rp><rt>yo</rt><rp>)</rp></ruby>:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Japanese chorus (final)</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><ruby> 愛<rp>(</rp><rt>ai</rt><rp>)</rp></ruby><ruby> に<rp>(</rp><rt>ni</rt><rp>)</rp></ruby><ruby> できる<rp>(</rp><rt>dekiru</rt><rp>)</rp></ruby><ruby> こと<rp>(</rp><rt>koto</rt><rp>)</rp></ruby><ruby> は<rp>(</rp><rt>wa</rt><rp>)</rp></ruby><ruby> まだ<rp>(</rp><rt>mada</rt><rp>)</rp></ruby><ruby> ある<rp>(</rp><rt>aru</rt><rp>)</rp></ruby><ruby> よ<rp>(</rp><rt>yo</rt><rp>)</rp></ruby></td>
<td class="org-left">I <b>know</b> there's still something that love can do</td>
</tr>

<tr>
<td class="org-left"><ruby> 僕<rp>(</rp><rt>boku</rt><rp>)</rp></ruby><ruby> に<rp>(</rp><rt>ni</rt><rp>)</rp></ruby><ruby> できる<rp>(</rp><rt>dekiru</rt><rp>)</rp></ruby><ruby> こと<rp>(</rp><rt>koto</rt><rp>)</rp></ruby><ruby> まだ<rp>(</rp><rt>mada</rt><rp>)</rp></ruby><ruby> ある<rp>(</rp><rt>aru</rt><rp>)</rp></ruby><ruby> よ<rp>(</rp><rt>yo</rt><rp>)</rp></ruby></td>
<td class="org-left">I <b>know</b> there's still something that I can do</td>
</tr>
</tbody>
</table>

<p>
This change of a single word brings the entire song to a satisfying conclusion.  However, the English version leaves the chorus unchanged, keeping the question posed to the girl the song is addressed to unresolved.
</p>
</div>
</div>

<div id="outline-container-org2a279bc" class="outline-2">
<h2 id="org2a279bc">Popularity</h2>
<div class="outline-text-2" id="text-org2a279bc">
<p>
RADWIMPS is an extremely popular band, to the point where I'll walk into a FamilyMart and they'll be playing on the radio.  Active since 2003, they've been approched numerous times for record deals.  Choral and instrumental arrangements of their songs are quite popular.  I've attended several recitals where performers sang or played their music, not to mention the countless times I've heard their songs sung at a karaoke bar.
</p>

<div class="org-center">
<p>
<iframe width="440" height="335" src="https://www.youtube.com/embed/N8g4nAphYRM" frameborder="0" allowfullscreen></iframe>
</p>

<p>
「<ruby> なん<rp>(</rp><rt>nan</rt><rp>)</rp></ruby><ruby> でも<rp>(</rp><rt>demo</rt><rp>)</rp></ruby><ruby> ない<rp>(</rp><rt>nai</rt><rp>)</rp></ruby><ruby> や<rp>(</rp><rt>ya</rt><rp>)</rp></ruby>」 ("It's Nothing") from <i>your name.</i> arranged for 3-part mixed chorus.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd3558fa" class="outline-2">
<h2 id="orgd3558fa"><ruby> 野田<rp>(</rp><rt>Noda</rt><rp>)</rp></ruby> <ruby> 洋次郎<rp>(</rp><rt>Yōjirō</rt><rp>)</rp></ruby></h2>
<div class="outline-text-2" id="text-orgd3558fa">
<p>
The band's frontman, Yojiro Noda, is well-known in Japan.  He lived in the U.S. for 4 years in elementary school and picked up a love of music.  I wish my Japanese could be as good as his English.
</p>
<div class="org-center">
<p>
<iframe width="440" height="335" src="https://www.youtube.com/embed/th8RmW9DinA" frameborder="0" allowfullscreen></iframe>
</p>

<p>
Frontman Yojiro Noda  translates for his bandmates during an interview with Gibson Guitars.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr><p class="date">Created  by Daniel Persigehl</p><div id="created"><p>Last updated 2022-04-01 金 08:52</p></div>
</div>
</body>
</html>
